IDEA StatiCa Open Model
IDEAProgressReport.CurrentProgressMessage Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 some message to pass to the UI of current progress
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public string CurrentProgressMessage { get; set; }
Public Property CurrentProgressMessage As String
	Get
	Set
public:
property String^ CurrentProgressMessage {
	String^ get ();
	void set (String^ value);
}
Property Value
Type: String
See Also
Reference
IDEAProgressReport Class
IdeaRS.OpenModel.Message Namespace